justinkk04/BLE-mesh-networking/ESP/CPP/ESP-Mesh-Node-sensor-universal-cpp/sdkconfig.defaults.esp32c6
# ESP32-C6 specific config
CONFIG_IDF_TARGET="esp32c6"
CONFIG_BT_LE_SCAN_DUPL_TYPE_DATA_DEVICE=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_BT_BLE_50_FEATURES_SUPPORTED=n
CONFIG_BT_LE_50_FEATURE_SUPPORT=n
